{
  "architectures": [
    "BrosModel"
  ],
  "image_size": [768,768],
  "coordinate_size": 171,
  "shape_size": 170,
  "attention_probs_dropout_prob": 0.1,
  "bbox_scale": 100.0,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 1024,
  "initializer_range": 0.02,
  "intermediate_size": 4096,
  "layer_norm_eps": 1e-12,
  "max_2d_position_embeddings": 1024,
  "max_position_embeddings": 512,
  "model_type": "bros",
  "num_attention_heads": 16,
  "num_hidden_layers": 24,
  "pad_token_id": 0,
  "pe_type": "crel",
  "torch_dtype": "float32",
  "transformers_version": "4.10.0",
  "type_vocab_size": 2,
  "vocab_size": 30522,
  "pair_direct_num": 9,
  "triple_cls_num": 5,
  "text_head": true,
  "visual_head": true,
  "text_mm_head": true,
  "visual_mm_head": true,
  "gradient_checkpoint": true
}
